* candlestick patterns

| name                 | days | signal    | Pattern                             | More Detail                                        |
|----------------------+------+-----------+-------------------------------------+----------------------------------------------------|
| Bullish Engulfing    |    2 | Bull      | Short black, long white             | preceding white engulfs previous black             |
| Bearish Engulfing    |    2 | Bear      | Short white, long black             | preceding black engulfs previous white             |
| hammer/hanging man   |    1 | bull/bear | white/black with shadow 3x of body  | placed at bottom/top determines the trend reversal |
| Morning star         |    3 | Bull      | white, little black, black          |                                                    |
| Morning doji         |    3 | Bull      | white, doji, black                  |                                                    |
| Evening star         |    3 | Bear      | black, little white, white          |                                                    |
| Evening doji         |    3 | Bear      | black, doji, white                  |                                                    |
| tweezer bull         |  3-4 | bull      | black 'lowest', - -, black 'lowest' |                                                    |
| tweezer bear         |  3-4 | bear      | white 'high', - -, white 'high'     |                                                    |
| harami bull          |    2 | bull      | long black, small white             |                                                    |
| harami bear          |    2 | bear      | long white, small black             |                                                    |
| harami star bull     |    2 | bull      | long black, doji                    |                                                    |
| harami star bear     |    2 | bear      | long white, doji                    |                                                    |
| abandoned baby       |    3 | bull/bear | white/black, far doji, black/white  | mid candle is far from the first and last          |
| gravestone           |    1 | bull      | doji with no top shadow             | either top is missing, bull signal                 |
| dragonfly            |    1 | bear      | doji with no bottom shadow          | either bottom is missing, bear signal              |
| three black crows    |    3 | bear      | 3 long body black                   | bear trend continues                               |
| three white soldiers |    3 | bull      | 3 long body white                   | bull trend continues                               |
| 1-2-3 bull           | >= 3 | bull      | lowest, lower high, higher low      |                                                    |
| 1-2-3 bear           | >= 3 | bear      | highest, higher low, lower high     |                                                    |

* Indicators

** Moving avarage

Simple Moving avarage (SMA) = Sum of closing points / intervals
Weighted Moving avarage (WMA) = Sum of closing points * weight / intervals ; where weight = periods i.e. 1,2,3...5 for 1st, 2nd, 3rd ... data
Exponential Moving avarage (EMA) = (today's Close * K) + EMA(Previous Day)*(1-K) ; where K=2/(intervals+1)

*** Indicates

Confirming the trend:
1. EMA has more tight corelation with SMA as it comprise of recent and all data
2. SMA(200) gives overall trend
3. SMA(50) SMA(200) plotted together gives
   1. SMA(50), crosses below SMA(200) -> downtrend
   2. SMA(50), crosses above SMA(200) -> uptrend
   3. price line touches SMA(50) from above -> resistance
   4. price line touches SMA(50) from below -> support

** MACD

Moving Avarage Convergence Divergence (MACD) is formed by 3 indicators:
1. MACD line = (12 days EMA) - (26 days EMA)
2. Signal line = (9 days EMA)
3. histograph of 2 signals difference, osc around the zero line

*** Indicators

Confirming the trend:
1. MACD line is below the Signal line -> bearish
2. MACD line is above the Signal line -> bullish
3. MACD line is above the zero line -> bullish
4. MACD line is below the zero line -> bearish

Prediction:
Divergence = MACD and price are not is not in agreement
1. Bullish divergence: price records lower low, MACD recoreds higher low -> significant bullish reversal
2. Bearish divergence: price records higher high, MACD recoreds lower high -> significant bearish reversal

** Bollinger Band

Bollinger Band is comprised of 3 lines:
1. 20 days SMA
2. 20 days SMA + (20 days SMA + Standard Deviation*2)
3. 20 days SMA - (20 days SMA + Standard Deviation*2)

*** Indicators

Confirming the trend:
1. support : the price touching the top of the band is support
2. resistance : the price touching the bottom of the band is resistance

caution:
Walking the Band: not all price points, that crosses the Bollinger Band is buy/sell signal. In a strong uptrend/downtrend, price may cross the Bollinger Band several times.

** Bollinger Band %B

Bollinger Band %B = (current price - lower band) / (upper band - lower band)

*** Indicators

Confirming the trend:
1. overbought : if the value if > 1 then market is overbought
2. oversold : if the value if < 0 then market is oversold
3. Solving Walkover: In a Strong uptrend/downtrend, even if price crosses above/below Bollinger Band, if %B is not crossing above 1 or below 0, it is not a sell/buy signal.

** RSI

Relative Strength (RS) = (average of upward price change) / (average of downward price change)
Relative Strength Index (RSI) = 100 - 100/(1 + RS)

*** Indicators

Confirming the trend:
1. overbought : if RSI > 70
2. oversold : if RSI < 30

Prediction:
1. bullish divergence : price makes a new low, RSI is higher low
2. bearish divergence : price makes a new high, RSI is lower high

** Ichimoku Kinko Hyo
Ichimoku (At a glance) Kinko (Balance) Hyo (Chart)
It has 5 parts-
1. Tenkan Sen: (highest high + lowest low)/2 for 9 periods
2. Kijun Sen: (highest high + lowest low)/2 for 26 periods
3. Chikou Span: current trend i.e. (highest high + lowest low)/2 lagging by 26 periods
4. Senkou Span A: (Tenkan Sen + Kijun Sen)/2 forward 26 periods
5. Senkou Span B: (highet high + Kijun Sen)/2 for 52 periods forward 26 periods
Senkou Span A and Senkou Span B together forms Komu cloud

Here,
9 = 1.5 of trade weeks i.e. (6 +3) days
26 = 1 trade month i.e (30 days - 4 sundays)
52 = 26*2

*** Indicators

Komu cloud:
1. anything above the cloud is bullish
2. anything below the cloud is bearish
3. anything within the cloud is nutral

Tenkan Sen crosses Kijun Sen:
1. above to below -> bearish
   1. within komu -> nutral
   2. above komu -> weak
   3. below komu -> strong
2. below to above -> bullish
   1. within komu -> nutral
   2. above komu -> strong
   3. below komu -> weak

Chikou Span:
1. above price -> bullish
2. below price -> bearish

Senkou Sapn A crosses Senkou Span B:
1. above to below -> bearish
2. below to above -> bullish

Finding support and resistance:
1. komu cloud's top and bottom will act as support/resistance
2. wider the cloud, difficult it is for price to break the cloud
3. once price breaks the cloud, new trend will be established.
4. narrow komu indicates consolidation

Ichimoku cloud works in conjunction with all 5 parts for best result. Steps:
1. Check the price against komu cloud
2. check Tenkan Sen Kijun Sen, see if it is crossed
3. check Chikou Span
4. also check the angle of Tenkan Sen, Kijun Sen and Chikou Span

* my strategy for trading

1. check MACD to verify trend
   1. if MACD is above signal and zero line -> strong sell signal
   2. if MACD is below signal and zero line -> strong buy signal
2. Moving average
   1. if SMA 21 holds the price action support -> good coin to buy
   2. check price action w.r.t. its "magic line"
      1. E.g. for BTC/USDT, it touches SMA 125 in approx 2 months, i.e. "magic line" = 125 SMA 1D
      2. always check the distance from this interval
	 1. if nearing -> sell
	 2. if touched -> buy
3. check price action
   1. bullish if any of these are seen in 1D interval -> buy
      1. bullish engulfing
      2. gravestone
   2. bearish if any of these are seen in 1D interval -> sell
      1. bearish engulfing
      2. hanging man
4. check BB% and RSI
   1. if BB% is below 0 and RSI is below 30% -> strong buy signal
   2. if BB% is above 1 and RSI is above 70% -> strong sell signal
5. confirm by BB
   1. if price is far above BB -> sell
   2. if price is far below BB -> buy
   3. if BB is stretched -> price may consolidate
6. further confirm by ichimoku cloud
   1. if price is above komu cloud -> bullish -> wait for sell signal
   2. if price is below komu cloud -> bearish -> wait for buy signal
   3. if price is inside komu cloud -> nutral -> may trigger false signals
7. check volume
   1. if the price is low and volume is expanding -> possible breakout -> buy

* manage stop loss

set loss = not more than 3% of total money in each bet
example:
if total money = 1000$
100$ it bet on BTC/USD
stop loss = 30$ for BTC/USD

* loss vs recorery in %

loss in % = x

recovery in % = 100x/(100-x)

| loss in % | recovery in % |
|-----------+---------------|
|         1 |     1.0101010 |
|         5 |     5.2631579 |
|        10 |     11.111111 |
|        20 |            25 |
|        30 |     42.857143 |
|        40 |     66.666667 |
|        50 |           100 |
|        60 |           150 |
|        70 |     233.33333 |
|        80 |           400 |
|        90 |           900 |
#+TBLFM: $2=(100*$1)/(100-$1)
